In [1]:
import pyodbc
import sqlite3

In [2]:
%reload_ext sql

### Connecting to the DataBase

In [3]:
%sql sqlite:///Loans.db

### Updating Table using CSV File

In [4]:
import pandas as pd

df = pd.read_csv('LoanData.csv')
conn = sqlite3.connect('Loans.db')
df.to_sql('LoanData', conn, if_exists='replace', index=False)
conn.close()

In [5]:
import pandas as pd

df = pd.read_csv('Customer.csv')
conn = sqlite3.connect('Loans.db')
df.to_sql('CustomerData', conn, if_exists='replace', index=False)
conn.close()

### Tables Created:

In [6]:
%%sql
SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///Loans.db
Done.

[('LoanData',), ('CustomerData',)]

In [7]:
%%sql
SELECT * FROM LoanData limit 5;

 * sqlite:///Loans.db
Done.

[('LP001002', None, 360.0, 'Y'),
 ('LP001003', 128.0, 360.0, 'N'),
 ('LP001005', 66.0, 360.0, 'Y'),
 ('LP001006', 120.0, 360.0, 'Y'),
 ('LP001008', 141.0, 360.0, 'Y')]

In [8]:
%%sql
SELECT * FROM CustomerData limit 5;

 * sqlite:///Loans.db
Done.

[('LP001002', 'Male', 'No', '0', 'Graduate', 'No', 5849, 'Urban', 1.0),
 ('LP001003', 'Male', 'Yes', '1', 'Graduate', 'No', 4583, 'Rural', 1.0),
 ('LP001005', 'Male', 'Yes', '0', 'Graduate', 'Yes', 3000, 'Urban', 1.0),
 ('LP001006', 'Male', 'Yes', '0', 'Not Graduate', 'No', 2583, 'Urban', 1.0),
 ('LP001008', 'Male', 'No', '0', 'Graduate', 'No', 6000, 'Urban', 1.0)]